controllers/MedicoController.php

INSERT INTO `tbl_medico` (`usuario`, `id_unidad`, `nombre`, `apellido`, `telefono1`, `telefono2`) VALUES ('medico 1', 11, 'rommel', 'escorihuela', '', '')
---
    public function actionCreate()
    {
        $model = new Medico();
        $unidad= new Unidades();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {